-- เพิ่มข้อมูลเริ่มต้นในตาราง SentimentAnalysis
INSERT INTO SentimentAnalysis (sentimentType) VALUES
('Positive'),
('Negative'),
('Neutral');

-- ต้องไป register user มาก่อน 2 คน

-- เพิ่มข้อมูลเริ่มต้นในตาราง Products
INSERT INTO Products (productName, startDate, endDate, createdAt, userId) VALUES
('สมาร์ทโฟนรุ่น X', '2025-01', '2025-12', '2025-03-25 10:00:00', 1),
('แท็บเล็ตรุ่น Z', '2025-02', '2025-11', '2025-03-25 10:30:00', 2),
('สมาร์ทโฟนรุ่น X', '2025-01', '2025-12', '2025-03-25 11:00:00', 2),
('แท็บเล็ตรุ่น Z', '2025-02', '2025-11', '2025-03-25 11:30:00', 1);

-- เพิ่มข้อมูลเริ่มต้นในตาราง CommentCategory
INSERT INTO CommentCategory (commentCategoryName) VALUES
('Product'),
('Delivery'),
('Service'),
('Other');

-- เพิ่มข้อมูลลงในตาราง comments
-- Insert Comments for สมาร์ทโฟนรุ่น X 
INSERT INTO Comments (ratings, text, date, sentimentId, userId, productId, commentCategoryId) VALUES
(5, 'สมาร์ทโฟนรุ่นนี้ใช้งานง่ายมาก หน้าจอคมชัด แบตเตอรี่อึดทนนาน คุ้มค่ากับราคาที่จ่ายไป', '2025-03-01', 1, 1, 1, 1), 
(3, 'ราคาแพงเกินไปสำหรับสเปคแบบนี้ ไม่คุ้มค่าเลย', '2025-03-02', 2, 2, 3, 1), 
(4, 'สมาร์ทโฟนกล้องสวยมาก ถ่ายรูปได้คมชัด แต่แบตหมดเร็ว', '2025-03-09', 3, 2, 3, 1), 
(4, 'สมาร์ทโฟนรุ่น X ดีกว่ารุ่นก่อนมาก คุ้มค่ากับการอัพเกรด', '2025-03-13', 1, 2, 3, 1), 
(3, 'จัดส่งรวด ได้รับสินค้าภายใน 2 วัน แพคเกจดี', '2025-03-05', 1, 1, 1, 2), 
(2, 'จัดส่งช้ามาก รอเกือบอาทิตย์กว่าจะได้รับสินค้า', '2025-03-07', 2, 1, 1, 2); 

-- Insert Comments for แท็บเล็ตรุ่น Z
INSERT INTO Comments (ratings, text, date, sentimentId, userId, productId, commentCategoryId) VALUES
(5, 'แท็บเล็ตรุ่น Z หน้าจอใหญ่และคมชัด การใช้งานลื่นไหล แบตเตอรี่ทนทานมาก', '2025-03-20', 1, 2, 2, 1), 
(4, 'แท็บเล็ตรุ่น Z ดีไซน์สวย แต่ราคาค่อนข้างสูงสำหรับฟีเจอร์ที่มี', '2025-03-21', 2, 1, 4, 1), 
(3, 'การใช้งานทั่วไปดี แต่บางครั้งช้ากว่าที่คิด', '2025-03-21', 3, 2, 2, 1), 
(4, 'แท็บเล็ตรุ่น Z มีฟีเจอร์ที่ดีสำหรับการทำงาน แต่มันหนักไปหน่อย', '2025-03-23', 1, 1, 4, 1), 
(2, 'การจัดส่งเร็วมาก แต่อยากให้การบรรจุภัณฑ์ดีกว่านี้', '2025-03-24', 1, 1, 4, 2), 
(3, 'จัดส่งช้ามาก ต้องรอเกือบอาทิตย์กว่าจะได้รับสินค้า', '2025-03-25', 2, 2, 2, 2),
(2, 'ผ่อนได้น้อยมาก อยากได้ผ่อนเยอะๆ จน เเต่โทรศัพโออยุ่', '2025-03-20', 1, 2, 2, 1);